[{"date":"April 1981","blurb":"In a stunning upset, Sanders wins the mayoral race in Burlington, Vermont’s largest city, by a mere 10 votes. Running as an independent, he shocks the city’s political establishment by defeating a six-term, local machine mayor."},{"date":"April 1983","blurb":"Sanders wins 52 percent of the vote, defeating his closest challenger by 21 points, to be re-elected to a second term as mayor. Burlington sets a record for voter turnout as the Sanders campaign energizes thousands of new voters."},{"date":"January 1984","blurb":"Mayor Sanders establishes the Burlington Community Land Trust, the first municipal housing land trust in the country for affordable housing. The project becomes a model emulated throughout the world. It later wins an award from Jack Kemp-led HUD."},{"date":"November 1990","blurb":"Sanders defeats incumbent Rep. Peter Smith in a race to be Vermont’s sole congressman. He is the first independent elected to the House in 40 years. He will be re-elected by the people of Vermont to serve eight terms."},{"date":"January 1991","blurb":"Congressman Sanders votes against a measure providing President George H. W. Bush with authorization to use military force in the Gulf War. “I have a real fear that the region is not going to be more peaceful or more stable after the war,” he says at the time."},{"date":"October 1992","blurb":"Congress passes Sanders’ first signed piece of legislation to create the National Program of Cancer Registries. A Reader’s Digest article calls the law “the cancer weapon America needs most.” All 50 states now run registries to help cancer researchers gain important insights."},{"date":"November 1993","blurb":"Sanders votes against the Clinton-era North American Free Trade Agreement. Returning from a tour of factories in Mexico, Sanders says: “If NAFTA passes, corporate profits will soar because it will be even easier than now for American companies to flee to Mexico and hire workers there for starvation wages.”"},{"date":"July 1996","blurb":"Sanders is one of only 67 votes against the discriminatory Defense of Marriage Act, which denied federal benefits to same-sex couples legally married. Sanders urged the Supreme Court to throw out the law, which it did in a landmark 2013 ruling – some 17 years later."},{"date":"July 1999","blurb":"Standing up against the major pharmaceutical companies, Sanders becomes the first member of Congress to take seniors across the border to Canada to buy lower-cost prescription drugs. The congressman continues his bus trips to Canada with a group of breast cancer patients the following April. These brave women are able to purchase their medications in Canada for almost one-tenth the price charged in the States."},{"date":"August 1999","blurb":"An overflow crowd of Vermonters packs a St. Michael’s College town hall meeting hosted by Sanders to protest an IBM plan to cut older workers’ pensions by as much as 50 percent. CBS Evening News with Dan Rather and The New York Times cover the event. After IBM enacts the plan, Sanders works to reverse the cuts, passing a pair of amendments to prohibit the federal government from acting to overturn a federal district court decision that ruled that IBM’s plan violated pension age discrimination laws. Thanks to Sanders’ efforts, IBM agreed to a $320 million legal settlement with some 130,000 IBM workers and retirees."},{"date":"November 1999","blurb":"About 10 years before the 2008 Wall Street crash spins the world economy into a massive recession, Sanders votes “no” on a bill to undo decades of financial regulations enacted after the Great Depression. “This legislation,” he predicts at the time, “will lead to fewer banks and financial service providers, increased charges and fees for individual consumers and small businesses, diminished credit for rural America and taxpayer exposure to potential losses should a financial conglomerate fail. It will lead to more mega-mergers, a small number of corporations dominating the financial service industry and further concentration of power in our country.” The House passed the bill 362-57 over Sanders’ objection."},{"date":"October 2001","blurb":"Sanders votes against the USA Patriot Act. “All of us want to protect the American people from terrorist attacks, but in a way that does not undermine basic freedoms,” Sanders says at the time. He subsequently votes against reauthorizing the law in 2006 and 2011."},{"date":"October 2002","blurb":"Sanders votes against the Bush-Cheney war in Iraq. He warns at the time that an invasion could “result in anti-Americanism, instability and more terrorism.”"},{"date":"June 2005","blurb":"Sanders passes an amendment in the House to stop the government from obtaining library and book-buying records on Americans. Unfortunately, the amendment is later removed in bicameral backroom negotiations."},{"date":"November 2006","blurb":"Sanders defeats Vermont’s richest man, Rich Tarrant, to be elected to the U.S. Senate. Sanders, running as an Independent, is endorsed by the Vermont Democratic Party and supported by the Democratic Senatorial Campaign Committee."},{"date":"December 2007","blurb":"Sanders’ authored energy efficiency and conservation grant program passes into law. He later secures $3.2 billion in the American Recovery and Reinvestment Act of 2009 for the grant program."},{"date":"September 2008","blurb":"Thanks to Sanders’ efforts, funding for the Low Income Home Energy Assistance Program funding doubles, helping millions of low-income Americans heat their homes in winter."},{"date":"February 2009","blurb":"Sanders works with Republican Sen. Chuck Grassley to pass an amendment to an economic recovery bill preventing Wall Street banks that take taxpayer bailouts from replacing laid-off U.S. workers with exploited and poorly-paid foreign workers."},{"date":"December 2009","blurb":"Sanders passes language in the Affordable Care Act to allow states to apply for waivers to implement pilot health care systems by 2017. The legislation allows states to adopt more comprehensive systems to cover more people at lower costs."},{"date":"March 2010","blurb":"President Barack Obama signs into law the Affordable Care Act with a major Sanders provision to expand federally qualified community health centers. Sanders secures $12.5 billion in funding for the program which now serves more than 25 million Americans. Another $1.5 billion from a Sanders provision went to the National Health Service Corps for scholarships and loan repayment for doctors and nurses who practice in underserved communities."},{"date":"July 2010","blurb":"Sanders works with Republican Congressman Ron Paul in the House to pass a measure as part of the Dodd-Frank Wall Street reform bill to audit the Federal Reserve, revealing how the independent agency gave $16 trillion in near zero-interest loans to big banks and businesses after the 2008 economic collapse."},{"date":"December 2010","blurb":"As Republicans and President Barack Obama push a deal that would extend Bush-era tax breaks for America’s wealthiest families, Sanders gives an eight-and-a-half hour filibuster-like speech on the Senate floor in opposition, citing growing economic inequality and increasing deficits."},{"date":"December 2012","blurb":"Sanders becomes chairman of the Senate Veterans’ Affairs Committee."},{"date":"March 2013","blurb":"Sanders, backed by seniors, women, veterans, labor unions and disabled Americans leads a successful effort to stop a “chained-CPI” proposal supported by Congressional Republicans and the Administration to cut Social Security and disabled veterans’ benefits."},{"date":"April 2013","blurb":"Sanders introduces legislation to break up major Wall Street banks so large that the collapse of one could send the overall economy into a downward spiral."},{"date":"August 2014","blurb":"A bipartisan $16.5 billion veterans bill written by Sanders, Sen. John McCain and Rep. Jeff Miller is signed into law by President Barack Obama. The measure includes $5 billion for the VA to hire more doctors and health professionals to meet growing demand for care."},{"date":"January 2015","blurb":"Sanders takes over as ranking member of the Senate Budget Committee, using the platform to fight for his economic agenda for the American middle class. Read the op-e"},{"date":"January 2015","blurb":"Sanders votes against the Keystone XL pipeline which would allow multinational corporation TransCanada to transport dirty tar sands oil from Canada to the Gulf of Mexico."},{"date":"May 2015","blurb":"Sanders declares his candidacy for the Democratic nomination for President of the United States. Watch the announcement."}]